app/Http/Controllers/UserChatsController.php

    public function index()
    {
        $data['pageTitle']     = 'Live Chat';

        $data['messages'] = Message::where('user_id', auth()->id())->with('admin')->get();
---
select * from `messages` where `user_id` = 2