app/Http/Controllers/Admin/ChatsController.php

    public function index()
    {
        $data['pageTitle']     = 'Chat with Admin';

        $data['users'] = User::chatUsersWithMessages()->get();
---
select * from `messages` where `messages`.`user_id` in (2)

    public function readMessage($userId)
    {
        $data['messages']  = Message::query()
            ->where('user_id', $userId)
            ->where('read_at', null)
            ->update([
                'read_at' => now(),
            ]);

        $data['users'] = User::chatUsersWithMessages()->get();
---
update `messages` set `read_at` = '2024-03-17 02:56:29', `messages`.`updated_at` = '2024-03-17 02:56:29' where `user_id` = '2' and `read_at` is null
select * from `messages` where `messages`.`user_id` in (2)